systems/centos/administration/selinux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>selinux</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">selinux</h1>
<pre class="example">
- ls -Z ; view 
- sestatus
- setenforce
  - setenforce permissive
- getsebool
  - getsebool allow_ftpd_anon_write
- setsebool
  - setsebool allow_ftpd_full_access on
- restorecon
- chcon
  - chcon -R --reference /etc/openvpn /etc/openvpn ; restore
  - chcon -R --reference=/var/ftp /var/ftp/

CREATE EXCEPTION
- ausearch - a tool to query audit daemon logs
- audit2allow - generate SELinux policy allow/dontaudit rules from
  logs of denied operations
- semodule - Manage SELinux policy modules.

- ausearch -c 'java' --raw | audit2allow -M my-java
- semodule -i my-java.pp 
</pre>

<p>
<a href="../centos.html">back</a>
</p>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
